<template>
    <v-container>
      <!-- Блок 1: Рекомендации по выбору React Native -->
      <v-card class="mb-5">
        <v-card-title class="headline blue--text">Рекомендации по выбору React Native</v-card-title>
        <v-card-text>
          React Native является оптимальным решением для разработчиков, стремящихся создавать высокопроизводительные кроссплатформенные приложения не уступающие нативным как в плане производительности, так и в функциональности и возможностях работы с нативными функциями устройства. В первую очередь данный фреймворк подходит для проектов, в которых важна высокая скорость загрузки и эффективное использование системных ресурсов, однако разработчикам стоит учитывать, что для работы с React Native помимо знаний базовых инструментов веб-разработки необходимо ознакомиться с фреймворком React и языком программирования TypeScript. Данные требования усложняют процесс обучения и увеличивают сроки разработки конечного продукта для команд незнакомых с необходимыми инструментами. Также стоит отметить эффективность использования React Native в сценарии, когда команде разработчиков необходимо адаптировать ранее разработанное веб-приложение основанное на React в виде мобильного приложения. Это достигается за счет совместимости компонентов и общего подхода к разработке, который React Native унаследовал у React. В итоге React Native является оптимальным решением для разработки высокопроизводительных приложений, поддерживающих глубокую интеграцию с нативными функциями устройств и поддержкой экосистемы фреймворка React.
        </v-card-text>
      </v-card>
  
      <!-- Блок 2: Рекомендации по выбору NativeScript -->
      <v-card class="mb-5">
        <v-card-title class="headline green--text">Рекомендации по выбору NativeScript</v-card-title>
        <v-card-text>
          NativeScript фреймворк подходящий для разработчиков, стремящихся использовать чистый JavaScript или TypeScript в связке с фреймворком Angular для создания приложений. Применение NativeScript особенно эффективно в сценариях, когда необходимо разработать приложение с интерфейсом приближенным к нативному, при этом фреймворк позволяет использовать стандартные инструменты веб разработки такие как HTML и CSS для стилизации компонентов, что позволяет ускорить разработку интерфейса. NativeScript позволяет разработчикам напрямую взаимодействовать с нативными API без промежуточных слоев как в React Native, что может быть полезно при необходимости реализации нестандартных задач по взаимодействию с нативными функциями устройства. Главным преимуществом NativeScript является возможность использования Angular, что позволяет разработчикам, уже имеющим опыт работы с данным фреймворком быстро интегрироваться в процесс разработки, и ускоряет процесс адаптации уже ранее разработанного веб-приложения. В итоге NativeScript рекомендуется использовать как решение для разработки производительных мобильных приложений на основе фреймворка Angular.
        </v-card-text>
      </v-card>
  
      <!-- Блок 3: Рекомендации по выбору Ionic -->
      <v-card class="mb-5">
        <v-card-title class="headline orange--text">Рекомендации по выбору Ionic</v-card-title>
        <v-card-text>
          Ionic является наиболее подходящим решением для проектов, где перед разработчиками стоит задача разработать несложное в плане функционала приложение без необходимости в реализации сложных анимаций требующих высокой производительности и с ограниченным временем на разработку. Благодаря тому, что фреймворк основан на стандартных веб-технологиях включающих HTML, CSS и JavaScript, а также поддерживает множество сторонних веб фреймворков он подходит для большинства веб разработчиков и позволяет приступить к разработке без необходимости в дополнительном изучении отдельных фреймворков, что позволяет ускорить процесс проектирования приложения с использованием уже имеющихся наработок и знаний. За счет поддержки множества сторонних веб фреймворков Ionic значительно упрощает процесс адаптации уже имеющегося веб приложения в мобильное без ограничений и необходимости переписывания уже ранее написанного кода. Главным сценарием для использования Ionic можно считать ситуацию, когда команде разработчиков необходимо разработать в сжатые сроки прототип приложения или MVP (минимально жизнеспособный продукт) без использования сложных анимаций и отсутствия необходимости к тесной интеграции с нативными API устройства.
        </v-card-text>
      </v-card>
    </v-container>
  </template>
  
  <script>
  export default {
  }
  </script>
  
  <style scoped>
  </style>
  